In [1]:
import numpy as np
import pandas as pd

In [2]:
my_df = pd.DataFrame(np.random.randn(4, 5), [1, 2, 3, 4], ['red', 'orange', 'yellow', 'green', 'blue'])

In [3]:
my_df

        red    orange    yellow     green      blue
1 -0.735527  1.879896  0.607163  0.783060  2.103607
2  0.777713  0.237508  0.615852 -0.615684  0.318391
3 -0.930395  0.963432 -1.854828 -0.577871  1.313831
4 -0.617870 -2.056778  0.129281  0.098779 -0.561053

In [4]:
my_df['orange']

1    1.879896
2    0.237508
3    0.963432
4   -2.056778
Name: orange, dtype: float64

In [5]:
my_df['red']

1   -0.735527
2    0.777713
3   -0.930395
4   -0.617870
Name: red, dtype: float64

In [6]:
type(my_df['orange'])

pandas.core.series.Series

In [7]:
type(my_df)

pandas.core.frame.DataFrame

In [8]:
my_df[['orange', 'yellow']]

     orange    yellow
1  1.879896  0.607163
2  0.237508  0.615852
3  0.963432 -1.854828
4 -2.056778  0.129281

In [9]:
type(my_df[['orange', 'yellow']])

pandas.core.frame.DataFrame

In [10]:
my_df['indigo'] = my_df['blue']

In [11]:
my_df

        red    orange    yellow     green      blue    indigo
1 -0.735527  1.879896  0.607163  0.783060  2.103607  2.103607
2  0.777713  0.237508  0.615852 -0.615684  0.318391  0.318391
3 -0.930395  0.963432 -1.854828 -0.577871  1.313831  1.313831
4 -0.617870 -2.056778  0.129281  0.098779 -0.561053 -0.561053

In [12]:
my_df['violet'] = my_df['blue'] + my_df['indigo']

In [13]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1 -0.735527  1.879896  0.607163  0.783060  2.103607  2.103607  4.207213
2  0.777713  0.237508  0.615852 -0.615684  0.318391  0.318391  0.636782
3 -0.930395  0.963432 -1.854828 -0.577871  1.313831  1.313831  2.627661
4 -0.617870 -2.056778  0.129281  0.098779 -0.561053 -0.561053 -1.122107

In [14]:
my_df.loc[2]

red       0.777713
orange    0.237508
yellow    0.615852
green    -0.615684
blue      0.318391
indigo    0.318391
violet    0.636782
Name: 2, dtype: float64

In [15]:
my_df.iloc[1]

red       0.777713
orange    0.237508
yellow    0.615852
green    -0.615684
blue      0.318391
indigo    0.318391
violet    0.636782
Name: 2, dtype: float64

In [16]:
my_df.iloc[2] = my_df.iloc[1]

In [17]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1 -0.735527  1.879896  0.607163  0.783060  2.103607  2.103607  4.207213
2  0.777713  0.237508  0.615852 -0.615684  0.318391  0.318391  0.636782
3  0.777713  0.237508  0.615852 -0.615684  0.318391  0.318391  0.636782
4 -0.617870 -2.056778  0.129281  0.098779 -0.561053 -0.561053 -1.122107

In [20]:
my_df.loc[2, 'orange']

0.23750822608472538

In [21]:
my_df.loc[[1,3], ['blue', 'violet']]

       blue    violet
1  2.103607  4.207213
3  0.318391  0.636782

In [24]:
my_df.drop(3, inplace=True)

In [25]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1 -0.735527  1.879896  0.607163  0.783060  2.103607  2.103607  4.207213
2  0.777713  0.237508  0.615852 -0.615684  0.318391  0.318391  0.636782
4 -0.617870 -2.056778  0.129281  0.098779 -0.561053 -0.561053 -1.122107

In [26]:
my_df.drop('indigo', axis=1)

        red    orange    yellow     green      blue    violet
1 -0.735527  1.879896  0.607163  0.783060  2.103607  4.207213
2  0.777713  0.237508  0.615852 -0.615684  0.318391  0.636782
4 -0.617870 -2.056778  0.129281  0.098779 -0.561053 -1.122107

In [27]:
my_df

        red    orange    yellow     green      blue    indigo    violet
1 -0.735527  1.879896  0.607163  0.783060  2.103607  2.103607  4.207213
2  0.777713  0.237508  0.615852 -0.615684  0.318391  0.318391  0.636782
4 -0.617870 -2.056778  0.129281  0.098779 -0.561053 -0.561053 -1.122107

In [28]:
my_df.drop('indigo', axis=1, inplace=True)

In [29]:
my_df

        red    orange    yellow     green      blue    violet
1 -0.735527  1.879896  0.607163  0.783060  2.103607  4.207213
2  0.777713  0.237508  0.615852 -0.615684  0.318391  0.636782
4 -0.617870 -2.056778  0.129281  0.098779 -0.561053 -1.122107

In [30]:
my_df.shape

(3, 6)